#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Experimental feature "module_variable_optional_attrs" is active

  on modules/cf-module/main.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cf_record_module["radically.digital"].cloudflare_record.default["spec.radical-c7964f1b561f84e0e16c184cb2baa1b9"]: Refreshing state... [id=e7548ec9c5d217699206fb05379f7ddc]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-25e5088c49d34337e731648f6e28c0c4"]: Refreshing state... [id=57d6ec8fd76f56502cd65760da4ce9dd]
module.cf_record_module["radically.digital"].cloudflare_record.default["default._bim-91bc68500fbf08cc2a5090ff7796e850"]: Refreshing state... [id=6b1b769e099f12bf3adeac4f3cce39b9]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-5e950554a11df186e582467bb0c884c6"]: Refreshing state... [id=d02b1f0eedf1259e32836d22ce311a2f]
module.cf_record_module["radically.digital"].cloudflare_record.default["s1._domainke-e9a2f08ccf03235c2a4383d743e3fd02"]: Refreshing state... [id=e256f2c62af78f69bb2ed71c9a024381]
module.cf_record_module["radically.digital"].cloudflare_record.default["k3._domainke-2412c55d2f49ac9a2bfa0096c9439feb"]: Refreshing state... [id=a90c0af57c2134cffde12256ef12a5c0]
module.cf_record_module["radically.digital"].cloudflare_record.default["www.radicall-bf66460b222a884896bf482dc7b38e1a"]: Refreshing state... [id=86e77c6cd25cd5b9709a12902b7306ae]
module.cf_record_module["radically.digital"].cloudflare_record.default["watchdog.rad-b256bb59ff4337de3cdac677634aa79b"]: Refreshing state... [id=e5d8113b7d105e1ae890f7622f3d7403]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-f722f7597ecc5709be676702e5974a70"]: Refreshing state... [id=142c580ee5d92fedb996b9de7946c79d]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-0eecb68f28d2ca8740fb6bad81cd038c"]: Refreshing state... [id=a5e16dcd46b393298069ac4abf2bfc9b]
module.cf_record_module["radically.digital"].cloudflare_record.default["watchdog.rad-65335c00af0d2c3b421e00db9a015028"]: Refreshing state... [id=9da636fa18dd671d8d488b07676f87d5]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-0aa45eed71133cf9f455d85e785821f6"]: Refreshing state... [id=6d5e6583f42cab68a9a75e66ae3c9d67]
module.cf_record_module["radically.digital"].cloudflare_record.default["readme.radic-adf56cc4edd18606a7aa808b5d76f907"]: Refreshing state... [id=2b6f21390266f72f87004d26051b73f4]
module.cf_record_module["radically.digital"].cloudflare_record.default["google._doma-0de21abe9bb391bb819a74da84d8655a"]: Refreshing state... [id=59094169047a58cb14cbe45908049e23]
module.cf_record_module["radically.digital"].cloudflare_record.default["s2._domainke-95d1ec54f87f51858a51ad5e0f2dcb38"]: Refreshing state... [id=1eb23108567cb33869097ea1725d951d]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-faea6a5109e6d50655eddccdc97955d7"]: Refreshing state... [id=57851b030aa5a8490ab8ddad8683608e]
module.cf_record_module["radically.digital"].cloudflare_record.default["spec.radical-3e1c1bae026f6a53964c38390836855d"]: Refreshing state... [id=7e67dfa03075e0add01ed2704b4ed79c]
module.cf_record_module["radically.digital"].cloudflare_record.default["rsta-dev.rad-38585470824502bd3fadcf88e228dca8"]: Refreshing state... [id=210da91c2ea863c02862e6ae98b0a19a]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-5b740688f90e78c8dc471e82f0e50e27"]: Refreshing state... [id=1add16e416a41a9066a8ec083d773a76]
module.cf_record_module["radically.digital"].cloudflare_record.default["spec.radical-e33b7f7af1598e1484bbb7797d3de30d"]: Refreshing state... [id=d45bd779ea5a8a82ed8003aa3fe45aa3]
module.cf_record_module["radically.digital"].cloudflare_record.default["rsta-dev.rad-4cf917850d013669aaa4fe007b9af3b2"]: Refreshing state... [id=e1041d853aae9bedb81e6044a14c3d66]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-e1918b7b5500b84680fc1221e410ab0e"]: Refreshing state... [id=9d044bfcbd8b32819d82bb0a02caa0ce]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-f94d017f1e9aae9c87394ec57e4c4808"]: Refreshing state... [id=e2af13f5222bcb8637e5e0cbc110596a]
module.cf_record_module["radically.digital"].cloudflare_record.default["_github-chal-ab896e119acad58ee786ef2dece3bce3"]: Refreshing state... [id=b1acb9c208088a426c90d9bc7b5e164e]
module.cf_record_module["radically.digital"].cloudflare_record.default["url3173.radi-55e684fe1be151cc7d685402d31de02e"]: Refreshing state... [id=ee54b6691b2c0e324b8d119c0d6c5409]
module.cf_record_module["radically.digital"].cloudflare_record.default["k2._domainke-43e2186ab72d8049166c5d4e3f3fa243"]: Refreshing state... [id=0d9b21d3e616c334ffefaeadbc4a7d62]
module.cf_record_module["radically.digital"].cloudflare_record.default["development.-ff31fb3cf895b2b62e008736cbd43dd6"]: Refreshing state... [id=2a0276ff49a161588ff89841075e215a]
module.cf_record_module["radically.digital"].cloudflare_record.default["26552100.rad-940b6faebfabd2ce88eca6d9a69ee402"]: Refreshing state... [id=586bb008df14481a69c879d8a36c54bd]
module.cf_record_module["radically.digital"].cloudflare_record.default["watchdog.rad-bd326a0c3bba7615051697bda4fff43b"]: Refreshing state... [id=4846f8fbd7f514e4d796a9bdd4b6cf78]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-59a352b66e475657e0dff097873a304c"]: Refreshing state... [id=4820aeda1b91dec1cde99f417d9cbd65]
module.cf_record_module["radically.digital"].cloudflare_record.default["poc-insights-431291db30c89e5d8a9f18be4ed48171"]: Refreshing state... [id=ba846c3ae4b91eb1ca7caf813e4c40e6]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-62c1dc0999684f3147e08a86d025aea4"]: Refreshing state... [id=7efb69c2e75aebfada3241318eedcb74]
module.cf_record_module["radically.digital"].cloudflare_record.default["spec.radical-1202d60658ac14ebba18feb0b9148769"]: Refreshing state... [id=05db5f2666442dcec7da17b299efda06]
module.cf_record_module["radically.digital"].cloudflare_record.default["em2060.radic-53b87817ea36fe555903057b03d593bd"]: Refreshing state... [id=71d84d4177693e9f9c0a579a5b7a026d]
module.cf_record_module["radically.digital"].cloudflare_record.default["watchdog.rad-281eb9f0c861cf75fd3ca3352ee41a1e"]: Refreshing state... [id=2b418946f5b7078d06654c44e316ff06]
module.cf_record_module["radically.digital"].cloudflare_record.default["shiba-e6b23eb33900566f3504f9bc9b415447"]: Refreshing state... [id=7058b3199e08fdd4c8f032a8da37486c]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-890289ef9b9ae16e1b20253cd782d87c"]: Refreshing state... [id=8a95b8fa87317cf50064073b9a9f40bc]
module.cf_record_module["radically.digital"].cloudflare_record.default["engineering.-da459b19938f798fb6193bc4ecab7f88"]: Refreshing state... [id=7d90e550943cd4ad1709785b07b21ee5]
module.cf_record_module["radically.digital"].cloudflare_record.default["tests.radica-f325909208936c4b84f936d5320d065e"]: Refreshing state... [id=defe2f7bb68925697d2237ac29dfac9a]
module.cf_record_module["radically.digital"].cloudflare_record.default["_dmarc-51977ede5aa142af142a3a02f320e1cb"]: Refreshing state... [id=3882b698e565748ceccffa943f26acea]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.cf_record_module["radically.digital"].cloudflare_record.default["development.-94276fd45c01d649da11819a416ade12"] will be created
  + resource "cloudflare_record" "default" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "development.radically.digital"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "c.storage.googleapis.com"
      + zone_id         = "dc2bb28469f7870cab9d8f715ffdce15"
    }

  # module.cf_record_module["radically.digital"].cloudflare_record.default["development.-ff31fb3cf895b2b62e008736cbd43dd6"] will be destroyed
  # (because key ["development.-ff31fb3cf895b2b62e008736cbd43dd6"] is not in for_each map)
  - resource "cloudflare_record" "default" {
      - allow_overwrite = false -> null
      - created_on      = "2022-10-20T11:18:57.656104Z" -> null
      - hostname        = "development.radically.digital" -> null
      - id              = "2a0276ff49a161588ff89841075e215a" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2022-10-20T11:18:57.656104Z" -> null
      - name            = "development.radically.digital" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - value           = "na-west1.surge.sh" -> null
      - zone_id         = "dc2bb28469f7870cab9d8f715ffdce15" -> null
    }

  # module.cf_record_module["radically.digital"].cloudflare_record.default["engineering-962d3262fef3176c273148b78c146e66"] will be created
  + resource "cloudflare_record" "default" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "engineering"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = "radically-digital.github.io"
      + zone_id         = "dc2bb28469f7870cab9d8f715ffdce15"
    }

  # module.cf_record_module["radically.digital"].cloudflare_record.default["engineering.-da459b19938f798fb6193bc4ecab7f88"] will be destroyed
  # (because key ["engineering.-da459b19938f798fb6193bc4ecab7f88"] is not in for_each map)
  - resource "cloudflare_record" "default" {
      - allow_overwrite = false -> null
      - created_on      = "2022-10-20T11:18:46.880183Z" -> null
      - hostname        = "engineering.radically.digital" -> null
      - id              = "7d90e550943cd4ad1709785b07b21ee5" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2022-10-20T11:18:46.880183Z" -> null
      - name            = "engineering.radically.digital" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - value           = "radically-digital.github.io" -> null
      - zone_id         = "dc2bb28469f7870cab9d8f715ffdce15" -> null
    }

  # module.cf_record_module["radically.digital"].cloudflare_record.default["greyhound-a702466c984b0fd5ed78077569567a57"] will be created
  + resource "cloudflare_record" "default" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "greyhound"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "c.storage.googleapis.com"
      + zone_id         = "dc2bb28469f7870cab9d8f715ffdce15"
    }

  # module.cf_record_module["radically.digital"].cloudflare_record.default["poodle-8061a18049931e8bb0fbe23673da7672"] will be created
  + resource "cloudflare_record" "default" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "poodle"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "c.storage.googleapis.com"
      + zone_id         = "dc2bb28469f7870cab9d8f715ffdce15"
    }

  # module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-5b740688f90e78c8dc471e82f0e50e27"] will be destroyed
  # (because key ["radically.di-5b740688f90e78c8dc471e82f0e50e27"] is not in for_each map)
  - resource "cloudflare_record" "default" {
      - allow_overwrite = false -> null
      - created_on      = "2022-10-20T11:18:46.400192Z" -> null
      - hostname        = "radically.digital" -> null
      - id              = "1add16e416a41a9066a8ec083d773a76" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2022-10-20T11:18:46.400192Z" -> null
      - name            = "radically.digital" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - value           = "na-west1.surge.sh" -> null
      - zone_id         = "dc2bb28469f7870cab9d8f715ffdce15" -> null
    }

  # module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-7121552104c0350c416adaa28c546388"] will be created
  + resource "cloudflare_record" "default" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "radically.digital"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "c.storage.googleapis.com"
      + zone_id         = "dc2bb28469f7870cab9d8f715ffdce15"
    }

Plan: 5 to add, 0 to change, 3 to destroy.

Warning: Experimental feature "module_variable_optional_attrs" is active

  on modules/cf-module/main.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @olmesm, Action: `pull_request`, Working Directory: ``, Workflow: `Run Action`*